#include <iostream>
#include <set>
using namespace std;
// تطبيقات البايتناري سيرش تري
//set ==>هي نوع من انواع الداتا ستركتر فهي عباررة عن كونتينر 
// و بما انها اشي جاهز من البايناري سيرش اذا بتتطبق مبدا ال avl tree
// يعني حتى لو التري اللي عطيتو اياها مش متوازنة بروح بحولها ل متزاونة 
// التايم كومبليكستي بكون logn
// ز كل الداتا بتكون يونيك 
// اذا عطيتو الداتا بطريقة مش بالانس مش متوازنة هوب رجعلي اياها بطريقة متوازنة
//
//


int main()
{
	set<int> s;
	s.insert(18);
	s.insert(2);
	s.insert(48);
	s.insert(22);
	s.size();
	// و اذا بعمل تكرار للعنصر ما برضى يزججع يضيف وما بزيد السايز

	// البوينتر الجاهو اللي بساعدني اعمل عملية التتبع هو iterator 
	// طباعة
	set<int>::iterator it = s.begin();
	for (auto i : s) {
		cout << i << " ";
	}
	// or
	while (it != s.end()) {
		cout << *it << " ";
		it++;

	}
	//اشي جاهز بساعدني ادور ع قيمة اسمها find وهي عبارة عن iterator اشي جاهزوهي عبارة عن بوينتر 

	if (s.find(2) != s.end()) {
		cout << " f";
	}
	else {
		cout << " not ";
	}

	s.erase(s.begin(), s.find(48));
	for (auto i : s) {
		cout << i << " ";
	}

	cout<<s.empty();
	//لما بدي اعرف العنصر كم مرة متكرر عندي يا حيطبع صفر او واحد لانو منوع التكرار 
	s.count(22);
}

